#ifndef _UNKNOWN_STRUCTS_H
#define _UNKNOWN_STRUCTS_H

#include "ultra64.h"

typedef struct {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ void (*unk_04)(void);
    /* 0x08 */ void (*unk_08)(void);
    /* 0x0C */ void* unk_0C;
    /* 0x10 */ u32 unk_10;
    /* 0x14 */ u32 unk_14;
    /* 0x18 */ u32 unk_18;
    /* 0x1C */ u32 unk_1C;
    /* 0x20 */ u32 unk_20;
    /* 0x24 */ u32 unk_24;
    /* 0x28 */ u32 unk_28;
    /* 0x2C */ u32 unk_2C;
    /* 0x30 */ u32 unk_30;
    /* 0x34 */ u32 unk_34;
    /* 0x38 */ void (*unk_38)(void);
    /* 0x3C */ void (*unk_3C)(void);
    /* 0x40 */ u32 unk_40;
    /* 0x44 */ u32 unk_44;
    /* 0x48 */ u32 unk_48;
    /* 0x4C */ u32 unk_4C;
    /* 0x50 */ u32 unk_50;
    /* 0x54 */ u32 unk_54;
    /* 0x58 */ u32 unk_58;
    /* 0x5C */ u32 unk_5C;
    /* 0x60 */ u32 unk_60;
    /* 0x64 */ u32 unk_64;
    /* 0x68 */ u32 unk_68;
    /* 0x6C */ u32 unk_6C;
    /* 0x70 */ u32 unk_70;
    /* 0x74 */ u32 unk_74;
    /* 0x78 */ u32 unk_78;
    /* 0x7C */ u32 unk_7C;
    /* 0x80 */ u32 unk_80;
    /* 0x84 */ u32 unk_84;
    /* 0x88 */ void (*unk_88)(void);
    /* 0x8C */ u32 unk_8C;
    /* 0x90 */ u32 unk_90;
    /* 0x94 */ u32 unk_94;
} Struct_800073AC;

#endif
